# -*- coding: utf-8 -*-

# Создать пакет, в который скопировать функции отрисовки из предыдущего урока
#  - радуги
#  - стены
#  - дерева
#  - смайлика
#  - снежинок
# Функции по модулям разместить по тематике. Название пакета и модулей - по смыслу.
# Создать модуль с функцией отрисовки кирпичного дома с широким окном и крышей.

# С помощью созданного пакета нарисовать эпохальное полотно "Утро в деревне".
# На картине должны быть:
#  - кирпичный дом, в окошке - смайлик.
#  - слева от дома - сугроб (предположим что это ранняя весна)
#  - справа от дома - дерево (можно несколько)
#  - справа в небе - радуга, слева - солнце (весна же!)
# пример см. lesson_005/results/04_painting.jpg
# Приправить своей фантазией по вкусу (коты? коровы? люди? трактор? что придумается)

import simple_draw as sd

from painting import fractal as paint_fractal, \
    rainbow as paint_rainbow, \
    smile as paint_smile, \
    snowfall as paint_snowfall, \
    wall as paint_wall

sd.resolution = (1200, 600)

paint_smile.smile(x=100, y=100, size=0.4, color=sd.COLOR_CYAN)
root_point = sd.get_point(900, 30)
paint_rainbow.rainbow()
paint_fractal.draw_branches_v2(start_point=root_point, angle=90, length=100)
paint_wall.wall()
paint_snowfall.snowfall()

sd.pause()

# Усложненное задание (делать по желанию)
# Анимировать картину.
# Пусть слева идет снегопад, радуга переливается цветами, смайлик моргает, солнце крутит лучами, етс.
# Задержку в анимировании все равно надо ставить, пусть даже 0.01 сек - так библиотека устойчивей работает.
